---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData.TotalConnectedCurrent
source: html/ad3f5984-a759-2911-e9a3-bfc476faa2b4.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData.TotalConnectedCurrent Property

The total connected current of the electrical analytical transfer switch.

## Syntax (C#)
```csharp
public double TotalConnectedCurrent { get; }
```